{
  "Apple": {
    "image_0": "/images/projects/apple/explore_app_simulator_1_optimized.jpg",
    "image_1": "/images/projects/apple/explore_app_simulator_1_optimized.jpg",
    "image_2": "/images/projects/apple/explore_app_simulator_2.png",
    "image_3": "/images/projects/apple/explore_app_simulator_3.png",
    "startDateMonth": "Aug",
    "startDateYear": "2020",
    "endDateMonth": "Sept",
    "endDateYear": "2023",
    "client_name": "Apple",
    "client_name_detail": "Apple",
    "jobTitle": "UI Dev Lead",
    "location": "Cupertino, CA",
    "description1": "Implemented frontend production requirements for Retail display applications, including the default retail display application for iPhone.",
    "description2": "Used SwiftUI syntax and patterns (HStacks, VStacks, etc.) to implement design, animation, and functional requirements into pixel-perfect, highly-accessible, iOS applications.",
    "description3": "Designed JSON structures responsible for providing application content to devices, allowing for complex features / functionality; satisfying complex business and application requirements (33 different languages, 8 different in-store devices).",
    "description10": "Wrote Python scripts to automate a variety of tasks, including verifying the file signature of image files; comparing and modifying JSON documents within a large repository containing content in 33 different languages.",
    "description5": "Advanced from UI Editor to UI Dev Lead by organizing projects, automating processes, troubleshooting application issues, and managing the work of of 2-5 other UI Editors during projects with very firm deadlines dictated by Apple’s seasonal product release dates.",
    "technologies_used": "SwiftUI, XCode, Python, Node, JSON, Proxyman, AEM, Git"
  },
  "Rubrik": {
    "image_0": "/images/projects/rubrik/rubrik_homepage_1_optimized.jpg",
    "image_1": "/images/projects/rubrik/rubrik_homepage_1_optimized.jpg",
    "image_2": "/images/projects/rubrik/rubrik_homepage_2.png",
    "image_3": "/images/projects/rubrik/rubrik_homepage_3.png",
    "startDateMonth": "Jan",
    "startDateYear": "2019",
    "endDateMonth": "Feb",
    "endDateYear": "2020",
    "client_name": "Rubrik",
    "client_name_detail": "Rubrik",
    "jobTitle": "Frontend Web Developer",
    "location": "Palo Alto, CA",
    "description1": "Worked with team and agencies to develop and maintain the rubrik.com website and its associated web properties.",
    "description3": "Developed Wordpress page templates with advanced frontend requirements, dynamic web form experiences with strict frontend validation requirements, and API integrations with multiple web services.",
    "description2": "Updated, maintained, and developed new page templates and components for the rubrik.com website using HTML, CSS (BEM), Javascript and PHP (Timber, Twig).",
    "description4": "Developed frontend integration with the Greenhouse API; used data to develop the careers listing, careers detail, and Job application form components.",
    "description9": "Developed marketing page sections, navigation menus, dynamic web forms with strict frontend validation, and more.",
    "description10": "Used Java build tools (Maven) to maintain local instance of AEM for frontend component development.",
    "description11": "Used CRXDE Lite and AEM CMS to manage, sync and replicate content (marketing copy, image assets) between AEM instances (dev, stage, prod, pub).",
    "description12": "Assisted in managing a CDN migration, working with Cloudflare and later Akamai to implement proper DNS configurations on existing, as well as newly acquired web domains.",
    "description13": "Managed Google Analytics reports, as well as website performance testing for Marketing department.",
    "technologies_used": "Docker, Wordpress, PHP, Timber, Twig, Javascript, Node, HTML, CSS (BEM), AEM, Git"
  },
  "Cloudera": {
    "image_0": "/images/projects/cloudera/cloudera_homepage_1_optimized.jpg",
    "image_1": "/images/projects/cloudera/cloudera_homepage_1_optimized.jpg",
    "image_2": "/images/projects/cloudera/cloudera_homepage_2.png",
    "image_3": "/images/projects/cloudera/cloudera_homepage_3.png",
    "startDateMonth": "Oct",
    "startDateYear": "2013",
    "endDateMonth": "Aug",
    "endDateYear": "2017",
    "client_name": "Cloudera",
    "client_name_detail": "Cloudera",
    "jobTitle": "Web Content Production Assistant",
    "location": "San Francisco, CA",
    "description1": "Worked with team and agencies to develop and maintain the cloudera.com website and its associated web properties during a period of rapid company growth.",
    "description2": "Developed page templates and components for cloudera.com, using HTML, CSS, Javascript, JSP and HTL.",
    "description3": "Developed a variety of frontend components, including marketing page templates, filter-able grids, navigation menus, and dynamic forms with strict validation rules. Built corresponding authorable components in the AEM CMS using Granite and Coral UI, consumed author input values into website components using JSP scriptlets, later updating to HTL.",
    "description10": "Used Java build tools (Maven) to maintain local AEM instance for frontend component development. Used Git, Gitflow, SourceTree and Jenkins to maintain version control, build and test individual AEM instances (dev, stage, prod, pub), as well as to deploy code along instances.",
    "description6": "Administered the publication of website content. Used tools like CRXDE Lite, VLT-RPC, Query Builder to manage, sync and replicate JCR content (user accounts, marketing copy, image assets) between AEM instances (dev, stage, prod, pub).",
    "technologies_used": "AEM Stack (Java, Maven, JCR, JSP, HTL, ExtJS), Jenkins, Javascript, HTML, CSS, Grunt"
  },
  "Timeline": {},
  "Gifhov": {},
  "Blog": {}
}
