{
  "name": "Max Nelson",
  "title": "Senior Web Engineer",
  "contactInfo": {
    "email": "maxnelson88@gmail.com",
    "phone": "+1.510-508-1392",
    "website": "maxnelsonwebsite.com"
  },
  "summary1": "Senior Web Engineer with eight years of experience developing high-traffic, highly-visible, websites and applications.",
  "summary2": "Experienced in developing maintainable frontend build systems, solving complex problems, and delivering quality solutions to fast-growing startups and large companies alike. Developing website applications, tools, features, and components, using many different languages, frameworks, and platforms, and integrating data from a variety of web services, databases, and content repositories.",
  "section1": {
    "title": "Experience",
    "timeline": {
      "clientName": "Timeline",
      "startDateMonth": "Oct",
      "startDateYear": "2023",
      "endDateMonth": "",
      "endDateYear": "Current",
      "location": "Berkeley, CA",
      "description1": "While pursuing my next opportunity, I have kept busy studying several modern javascript frameworks including: D3.js, Vite, Express, and React; utilizing them towards a self-initiated project, a data visualization web application currently hosted at https://timelineapp.io.",
      "technologies_used": "D3, Google Cloud Platform, Firestore, Node, Vite, Express, React, OAuth2"
    },
    "apple": {
      "clientName": "Apple",
      "jobTitle": "UI Dev Lead",
      "startDateMonth": "Aug",
      "startDateYear": "2020",
      "endDateMonth": "Oct",
      "endDateYear": "2023",
      "location": "Cupertino, CA",
      "description1": "Implemented frontend production requirements for retail display applications, including the default retail display application for iPhone.",
      "description2": "Composed SwiftUI elements and configured their properties to implement design, animation, and functional requirements, creating pixel-perfect, highly robust, iOS applications highly visible on display devices in Apple stores globally.",
      "description3": "Designed and developed a flexible, dynamic component system, capable of adapting to the content of 8 different devices, in 33 different languages, at any of 12 ADA-compliant system font sizes.",
      "description4": "Designed JSON structures responsible for providing application content, allowing for complex features / functionality; satisfying complex business and application requirements.",
      "description5": "Advanced from UI Editor to UI Dev Lead by organizing projects, automating processes, troubleshooting application issues, and managing the work of of 2-5 other UI Editors, during projects with very firm deadlines dictated by Apple’s seasonal product release dates.",
      "technologies_used": "SwiftUI, XCode, Python, Node, JSON, Proxyman, AEM, Git"
    },
    "rubrik": {
      "clientName": "Rubrik",
      "jobTitle": "Frontend Web Developer",
      "location": "Palo Alto, CA",
      "startDateMonth": "Jan",
      "startDateYear": "2019",
      "endDateMonth": "Feb",
      "endDateYear": "2020",
      "description1": "Functioned as the only in-house web developer, underneath marketing, working closely with agencies to develop and maintain the rubrik.com website and its associated web properties.",
      "description2": "Developed Wordpress page templates and components with advanced frontend requirements, including frontend integration with API data from multiple web services, using PHP (Timber, Twig), HTML, CSS (BEM), and Javascript.",
      "description3": "Oversaw platform migration from Wordpress to Adobe Experience Manager (AEM). Developed AEM components using HTL (Sightly), JavaScript, and Apache Sling, integrating with a JSR-170 repository.",
      "description4": "Oversaw CDN migration from Cloudflare to Akamai. Configured DNS records for new web properties.",
      "technologies_used": "Docker, Wordpress, PHP (Timber, Twig), Javascript, Node, HTML, CSS (BEM), AEM, Git"
    },
    "cloudera": {
      "clientName": "Cloudera",
      "jobTitle": "Web Content Production Assistant",
      "location": "San Francisco, CA",
      "startDateMonth": "Oct",
      "startDateYear": "2013",
      "endDateMonth": "Sept",
      "endDateYear": "2017",
      "description1": "Worked with team and agencies to develop the cloudera.com website and its associated web properties.",
      "description2": "Hired as employee #334, grew the web team from 2 to 5 developers while contributing to the rapid company growth towards 1800 employees at the time of my departure.",
      "description3": "Developed dynamic frontend AEM components using JSP (later upgrading to HTL [Sightly]), Javascript, HTML and CSS. Built forms corresponding to each component using ExtJS, Granite and Coral UI, allowing Marketing stakeholders to author and publish content. Trained authors, hosted office hours, created PDF documentation.",
      "description4": "Developed frontend integrations and utilized data from a variety of APIs and web services including Learndot, Demandbase, Jobvite, Eloqua and SFDC.",
      "description5": "Managed the publication of web content, used AEM Admin tools like CRXDELite, QueryBuilder, Bulk Editor, and VLT-RPC to manage, sync, and replicate JCR content across AEM instances (dev, auth, stage, prod, pub).",

      "technologies_used": "AEM Stack (Java, Maven, JCR, JSP, HTL, ExtJS), Jenkins, Grunt, Javascript, HTML, CSS"
    }
  },
  "section2": {
    "education": {
      "title": "Education",
      "degree": "BA in Graphic Design",
      "school": "California State University, Chico",
      "startDateYear": "2007",
      "endDateYear": "2011",
      "description": "Studied many mediums of Graphic Design, including User Interface Design, with an upper-division theme in computer programming."
    },
    "skills": {
      "title": "Skills",
      "skill1": {
        "title": "Javascript",
        "description": "React • Typescript • Node • Express • D3"
      },
      "skill2": {
        "title": "Pre/Post Processing Tools",
        "description": "Vite • Rollup • Babel • PostCSS"
      },
      "skill3": {
        "title": "Databases",
        "description": "Firebase • Firestore"
      },
      "skill4": {
        "title": "Python",
        "description": "Flask"
      },
      "skill5": {
        "title": "PHP",
        "description": "WordPress"
      },
      "skill6": {
        "title": "Cloud Platforms",
        "description": "Google Cloud Platform"
      }
    }
  }
}
