{
  "name": "Max Nelson",
  "title": "Senior Web Engineer",
  "contactInfo": {
    "email": "maxnelson88@gmail.com",
    "phone": "+1.510-508-1392",
    "website": "maxnelsonwebsite.com"
  },
  "summary1": "Senior Web Engineer with eight years of experience developing high-traffic, highly-visible websites and applications.",
  "summary2": "Experienced in developing maintainable frontend build systems, solving complex problems, and delivering quality solutions to fast-growing startups and large companies alike. Developing website applications, tools, features and components using many platforms, languages and frameworks including, AEM, GCP, Node, Python, PHP, Javascript, React, HTML and CSS; integrating data from a variety of web services, databases, and content repositories.",
  "section1": {
    "title": "Experience",
    "timeline": {
      "clientName": "Timeline",
      "startDateMonth": "Oct",
      "startDateYear": "2023",
      "endDateMonth": "",
      "endDateYear": "Current",
      "location": "Berkeley, CA",
      "description1": "While pursuing my next opportunity, I have kept busy studying several modern javascript frameworks including: D3.js, Vite, Express, and React; utilizing them towards a self-initiated project, a data visualization web application currently hosted at https://timelineapp.io.",
      "technologies_used": "D3, Google Cloud Platform, Firestore, Node, Vite, Express, React, OAuth2"
    },
    "apple": {
      "clientName": "Apple",
      "jobTitle": "UI Dev Lead",
      "startDateMonth": "Aug",
      "startDateYear": "2020",
      "endDateMonth": "Oct",
      "endDateYear": "2023",
      "location": "Cupertino, CA",
      "description1": "Implemented frontend production requirements for Retail display applications, including the default retail display application for iPhone.",
      "description2": "Used an internal tool, similar to XCodes' Storyboard, to layout SwiftUI elements (HStacks, VStacks, etc.) and configure their properties to create pixel-perfect, highly robust, accessible, and dynamic widgets and components.",
      "description3": "Components built to be dynamic and adapt to fit content in 33 different languages, as well as content featured in eight different in-store devices, which each ran slightly different experiences, accomodated by the flexibility of the component system.",
      "description4": "Designed JSON structures responsible for providing application content to devices, allowing for complex features / functionality, and satisfying complex business and application requirements.",
      "description5": "Advanced from UI Editor to UI Dev Lead by organizing projects, automating processes, troubleshooting application issues, and managing the work of of 2-5 other UI Editors during projects with very firm deadlines dictated by Apple’s seasonal product release dates.",
      "technologies_used": "SwiftUI, XCode, Python, Node, JSON, Proxyman, AEM, Git"
    },
    "rubrik": {
      "clientName": "Rubrik",
      "jobTitle": "Frontend Web Developer",
      "location": "Palo Alto, CA",
      "startDateMonth": "Jan",
      "startDateYear": "2019",
      "endDateMonth": "Feb",
      "endDateYear": "2020",
      "description1": "Worked with team and agencies to develop and maintain the rubrik.com website and its associated web properties.",
      "description2": "Updated, maintained, and developed Wordpress page templates and components, using PHP (Timber, Twig), HTML, CSS (BEM), and Javascript.",
      "description3": "Developed the Frontend of many AEM components, using Javascript, HTML, CSS, HTL (Sightly), and Apache Sling to integrate with OSGI-registered Java servlet applications, and a JCR Jackrabbit Oak repository.",
      "description4": "Developed a variety of components, including everything from marketing page sections to dynamic web forms with strict frontend validation. For example, developed a Frontend integration with the Greenhouse API; used data to develop the careers listing, careers detail, and Job application form components.",
      "technologies_used": "Docker, Wordpress, PHP, Timber, Twig, Javascript, Node, HTML, CSS (BEM), AEM, Git"
    },
    "cloudera": {
      "clientName": "Cloudera",
      "jobTitle": "Web Content Production Assistant",
      "location": "San Francisco, CA",
      "startDateMonth": "Oct",
      "startDateYear": "2013",
      "endDateMonth": "Sept",
      "endDateYear": "2017",
      "description1": "Worked with team and agencies to develop and maintain the cloudera.com website and its associated web properties during a period of high company growth.",
      "description2": "Developed a variety of page templates and components using HTML, CSS, Javascript, JSP and HTL (Sightly), components including: marketing page sections, filter-able grids with animation, navigation menus, dynamic forms with strict Frontend validation requirements.",
      "description3": "Built corresponding authorable components in the AEM CMS using Granite and Coral UI. These form widgets consumed author input values and made them accessible to the Frontend components via the templating language (JSP scriptlets, later updating to HTL [Sightly]).",
      "description4": "Administered the publication of website content. Used tools like CRXDE Lite, VLT-RPC, Query Builder to manage, sync and replicate JCR content (user accounts, marketing copy, image assets) across AEM instances (dev, stage, prod, pub).",
      "technologies_used": "AEM Stack (Java, Maven, JCR, JSP, HTL, ExtJS), Jenkins, Javascript, HTML, CSS, Grunt"
    }
  },
  "section2": {
    "education": {
      "title": "Education",
      "degree": "BA in Graphic Design",
      "school": "California State University, Chico",
      "startDateYear": "2007",
      "endDateYear": "2011",
      "description": "Studied many mediums of Graphic Design, including Information Design, Typography, Branding, and User Interface Design, with an upper-division theme in computer programming."
    },
    "skills": {
      "title": "Skills",
      "skill1": {
        "title": "Javascript",
        "description": "Typescript • Node • Express • React • D3"
      },
      "skill2": {
        "title": "Pre/Post Processing Tools",
        "description": "PostCSS • Rollup • Vite"
      },
      "skill3": {
        "title": "Databases",
        "description": "Firebase • Firestore"
      },
      "skill4": {
        "title": "Python",
        "description": "Flask"
      },
      "skill5": {
        "title": "PHP",
        "description": "WordPress"
      },
      "skill6": {
        "title": "Cloud Platforms",
        "description": "Google Cloud Platform"
      }
    }
  }
}
